Smart-Inclusive-Keyboard/esp32s3_smart_keyboard/sdkconfig.defaults.esp32s3
# ESP32-S3-specific defaults.
# Applied automatically by: idf.py set-target esp32s3

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM (octal, 80 MHz) -- present on the Waveshare ESP32-S3-Touch-LCD-3.49.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Push NimBLE's host environment into PSRAM where possible.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# More heap for the audio task -- WAV decode buffers live in PSRAM
# but the I2S DMA descriptors and ring buffers live in internal RAM.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
